benchbnb/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "RQTYAy9I_N5iOXOrFpg8GA"], ["LIMIT", 1]]
---
  def current_user
    user = User.find_by_session_token(session[:session_token])