benchbnb/app/controllers/api/sessions_controller.rb

  def create
    @user = User.find_by_credentials(params[:user][:username], params[:user][:password])
    if @user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "QHJuuj1M_Qyqodefd8PClA"], ["updated_at", "2018-12-10 18:29:18.673908"], ["id", 1]]